; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=46, out_folder=htg/blocksworld/training, instance_id=26, seed=2050

(define (problem blocksworld-26)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 - object)
 (:init 
    (arm-empty)
    (clear b3)
    (on b3 b1)
    (on b1 b42)
    (on b42 b30)
    (on b30 b6)
    (on b6 b21)
    (on b21 b4)
    (on b4 b7)
    (on b7 b28)
    (on b28 b10)
    (on b10 b32)
    (on b32 b19)
    (on b19 b13)
    (on b13 b45)
    (on b45 b15)
    (on-table b15)
    (clear b11)
    (on b11 b8)
    (on b8 b31)
    (on-table b31)
    (clear b20)
    (on b20 b29)
    (on-table b29)
    (clear b26)
    (on b26 b33)
    (on b33 b40)
    (on b40 b9)
    (on b9 b2)
    (on b2 b12)
    (on b12 b46)
    (on-table b46)
    (clear b36)
    (on-table b36)
    (clear b44)
    (on b44 b34)
    (on b34 b37)
    (on b37 b35)
    (on b35 b17)
    (on b17 b16)
    (on b16 b5)
    (on b5 b43)
    (on-table b43)
    (clear b39)
    (on b39 b24)
    (on b24 b41)
    (on b41 b27)
    (on b27 b23)
    (on-table b23)
    (clear b18)
    (on b18 b25)
    (on b25 b14)
    (on b14 b22)
    (on b22 b38)
    (on-table b38))
 (:goal  (and 
    (clear b2)
    (on b2 b4)
    (on b4 b1)
    (on b1 b3)
    (on-table b3))))

; plan
1. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 0 of 5
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 5
3. (unstack b1 b42)
   deleted: (on b1 b42) (clear b1) (arm-empty)
   added: (holding b1) (clear b42)
   goals met: 1 of 5
4. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 2 of 5
5. (unstack b42 b30)
   deleted: (on b42 b30) (clear b42) (arm-empty)
   added: (holding b42) (clear b30)
   goals met: 2 of 5
6. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 2 of 5
7. (unstack b26 b33)
   deleted: (on b26 b33) (clear b26) (arm-empty)
   added: (holding b26) (clear b33)
   goals met: 2 of 5
8. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 5
9. (unstack b30 b6)
   deleted: (on b30 b6) (clear b30) (arm-empty)
   added: (holding b30) (clear b6)
   goals met: 2 of 5
10. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 5
11. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 2 of 5
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 5
13. (unstack b21 b4)
   deleted: (on b21 b4) (clear b21) (arm-empty)
   added: (holding b21) (clear b4)
   goals met: 2 of 5
14. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 5
15. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 2 of 5
16. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 3 of 5
17. (unstack b33 b40)
   deleted: (on b33 b40) (clear b33) (arm-empty)
   added: (holding b33) (clear b40)
   goals met: 3 of 5
18. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 3 of 5
19. (unstack b40 b9)
   deleted: (on b40 b9) (clear b40) (arm-empty)
   added: (holding b40) (clear b9)
   goals met: 3 of 5
20. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 5
21. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 4 of 5
22. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 4 of 5
23. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 3 of 5
24. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 5 of 5
